const tests = [
    {
        input: '(1DX10) ＞ 1[1] ＞ 0 (ファンブル)',
        expected: '1dx+10@10',
        note: '普通のファンブル'
    }, {
        input: '(4DX10) ＞ 1[1,1,1,1] ＞ 0 (ファンブル)',
        expected: '1dx+10@10',
        note: 'ダイスを複数振った場合のファンブル'
    }, {
        input: '4dx@10 1[1,1,1,1] ＞ 0 (ファンブル) はいやじゃ、いやじゃ、妾はファンブルなどだしとうないっ\n(4DX10) ＞ 1[1,1,1,1] ＞ 0 (ファンブル)',
        expected: '1dx+10@10',
        note: '面倒なコメントが入っている場合のファンブル'
    }, {
        input: '(1DX10+4) ＞ 1[1]+4 ＞ 0 (ファンブル)',
        expected: '1dx+14@10',
        note: '固定値を含むファンブル'
    }, {
        input: '8dx+4 (8DX7+4) ＞ 10[1,2,2,2,3,3,5,7]+10[8]+4[2,4]+4 ＞ 28',
        expected: '1dx+34@7',
        note: '通常の判定（コマンド含む）'
    }, {
        input: '(8DX7+4) ＞ 10[1,2,2,2,3,3,5,7]+10[8]+4[4]+4 ＞ 28',
        expected: '1dx+34@7',
        note: '通常の判定'
    }, {
        input: '8dx+4 こいつが超ベジータのビッグ・バン・アタックだ「ベジータ」\n(8DX7+4) ＞ 10[1,2,2,2,3,3,5,7]+10[8]+4[4]+4 ＞ 28',
        expected: '1dx+34@7',
        note: '面倒なコメントが入っている場合の通常の判定'
    }, {
        input: '(16DX7-2) ＞ 10[2,2,2,3,4,6,6,7,7,7,8,8,9,9,9,10]+10[1,1,2,4,4,5,6,8,10]+4[2,4]-2 ＞ 22',
        expected: '1dx+28@7',
        note: '固定値がマイナスの場合'
    }, {
        input: '8dx (8DX7) ＞ 10[2,4,5,6,6,7,8,8]+10[5,6,9]+10[7]+10[7]+10[10]+10[7]+10[9]+10[8]+2[2] ＞ 82',
        expected: '1dx+90@7',
        note: '固定値がない通常の判定（コマンド含む）'
    }, {
        input: '(8DX7) ＞ 10[2,4,5,6,6,7,8,8]+10[5,6,9]+10[7]+10[7]+10[10]+10[7]+10[9]+10[8]+2[2] ＞ 82',
        expected: '1dx+90@7',
        note: '固定値がない通常の判定'
    }, {
        input: '1dx+3 (1DX11+3) ＞ 9[9]+3 ＞ 12',
        expected: '13',
        note: 'クリティカルが発生せず再判定が要らない場合'
    }
];
